# GetTableData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..GetTableData Method
PanelScheduleTemplate Class See Also
---
Gets the writable table data object.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelScheduleData GetTableData()
```

Visual Basic
---
```text
Public Function GetTableData As PanelScheduleData
```

Visual C++
---
```text
public:
PanelScheduleData^ GetTableData()
```

# ### Return Value
The panel schedule data object.
# Remarks
Access to this information requires an open transaction.
# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace